app/controllers/password_resets_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'cuongtm12.dev@gmail.com' LIMIT 1
---
  def create
    @user = User.find_by(email: params[:password_reset][:email].downcase)

UPDATE `users` SET `users`.`updated_at` = '2022-01-24 01:46:15.204739', `users`.`password_digest` = '$2a$12$LRCkXZC3s0Tx7OXuVX611.CZDWvkTDf5addzhOTuyDM2RjVvWq/by' WHERE `users`.`id` = 63
---
  def update
    if params[:user][:password].blank?
      @user.errors.add :password, t("cannot_blank")
      render :edit
    elsif @user.update(user_params)

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'cuongtm12.dev@gmail.com' LIMIT 1
---
  def load_user
    @user = User.find_by email: params[:email]