app/controllers/users_controller.rb

SELECT `users`.* FROM `users` ORDER BY `users`.`created_at` DESC LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM `users`
---
  def index
    @pagy, @users = pagy User.all.latest_user, items: Settings.items_page

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`, `activation_digest`) VALUES ('Cuong TM', 'cuongtm1.dev@gmail.com', '2022-01-20 05:02:22.622040', '2022-01-20 05:02:22.622040', '$2a$12$oXqBgH7E/yyhJ/kl7bLCcurbX3ZZgXYtUi.XLHMTd/D6X1BqVph4.', '$2a$12$ZpUH8NMJNnC.QetMftji0Oj5gg9bk.HiWm3iF1tqKX5nkZ5tx1x.a')
---
  def create
    @user = User.new user_params
    if @user.save

UPDATE `users` SET `users`.`name` = 'Cuong TM', `users`.`updated_at` = '2022-01-19 08:42:54.886842', `users`.`password_digest` = '$2a$12$h1C15oN3BwNJq2rh7XobwuCXZxZ3Hk1NHLmtAnHnAgRhWn1hwKtVm' WHERE `users`.`id` = 1
---
  def update
    if @user.update user_params

DELETE FROM `users` WHERE `users`.`id` = 60
---
  def destroy
    if @user.destroy

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def find_user_by_id
    @user = User.find_by id: params[:id]